using BakeryStore.Interfaces;
using BakeryStore.Models;

namespace BakeryStore.Database
{
    public class DBObjects
    {

        //функція для підключення до БД
        public static void Initial(AppDBContent content)
        {
            //якщо не має жодної категорії, то додаємо категорії
            if (!content.Category.Any())
            {
                content.Category.AddRange(Categories.Select(c => c.Value));
            }
            //якщо не має жодного товару, то додаємо товар
            if (!content.Product.Any())
            {
                Product product1 = new Product
                {
                    Id = 1,
                    Title = "Горішок",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/689.1900x1900.jpg",
                    Description = "Торт-комбо з улюбленого торта жителів та гостей столиці та \"саме тих\" горішків з дитинства. Легкі коржі безе із фундуком та улюблений крем із вареним згущеним молоком",
                    Price = decimal.Parse("600"),
                    Stuff = "молоко згущене варене 8,5% МОЛОКО КОРОВ‛ЯЧЕ, цукор білий кристалічний( не менше 43.5%), МОЛОЧНИЙ ЦУКОР (ЛАКТОЗА)\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nцукрова пудра\r\nФУНДУК\r\nБІЛОК ЯЄЧНИЙ\r\nБОРОШНО ПШЕНИЧНЕ В/Г\r\nСИР ВЕРШКОВИЙ 65% КРЕМЕТТЕ сир кисломолочний,згущувач: модифіко ваний крохмаль, стабілізатори: камідь рожкового дерева, гуарова камідь\r\nМОЛОКО КОРОВ’ЯЧЕ НЕЗБИРАНЕ ЗГУЩЕНЕ 8,5% (МОЛОКО КОРОВ‛ЯЧЕ, цукор білий кристалічний ( не менше 43.5%), МОЛОЧНИЙ ЦУКОР ( ЛАКТОЗА)).\r\nЖОВТОК ЯЄЧНИЙ\r\nкрохмаль кукурудзяний\r\nсіль",
                    Calories = "Калорійність ккал: 434.06\r\nКалорійність кДж: 1817.31\r\nЖири: 29.28\r\nНасичені жири: 16.27\r\nВуглеводи: 36.87\r\nЦукор: 31.51\r\nБілки: 5.77\r\nСіль: 0.23",
                    Weight = 0.6,
                    ShelfLife = 3,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Торти"]
                };

                Product product2 = new Product
                {
                    Id = 2,
                    Title = "Мохіто міні",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/694.1900x1900.jpg",
                    Description = "Позасезонний фаворит - торт Мохіто у своїй міні-версії. В ньому тонкий мигдалевий бісквіт, найароматніший м'ятно-лаймовий крем та сезонні ягоди.",
                    Price = decimal.Parse("500"),
                    Stuff = "ШОКОЛАД БІЛИЙ цукор, какао-масло, МОЛОКО сухе незбиране, МОЛОКО сухе знежирене, еквівалент какао-масла (негідрогенізовані пальмова олія, олія ши, олія ілліпе), жир МОЛОЧНИЙ,емульгатори(СОЄВИЙ лецитин Е476),ароматизатор\r\nполуниця свіжа\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 30%\r\nцукор білий\r\nМИГДАЛЬ СИРИЙ\r\nБІЛОК ЯЄЧНИЙ\r\nЖОВТОК ЯЄЧНИЙ\r\nсік лимона\r\nвода підготовлена\r\nсік лайма\r\nмята\r\nкрохмаль кукурудзяний\r\nцедра лайма\r\nрозпушувач\r\nжеле для торта DR.OETKER цукор,загущувач: карагенан Е407, стабілізатор: бітартрат калію Е336і, желеутворювач: камедь рожкового дерева Е410, желюючий агент(хлорид калію(Е508)).",
                    Calories = "Калорійність ккал: 347.46\r\nКалорійність кДж: 1454.74\r\nЖири: 21.32\r\nНасичені жири: 11.75\r\nВуглеводи: 33.65\r\nЦукор: 32.35\r\nБілки: 5.25\r\nСіль: 0.18",
                    Weight = 0.5,
                    ShelfLife = 3,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Торти"]
                };

                Product product3 = new Product
                {
                    Id = 3,
                    Title = "Пряник контурний Mickey & Minnie Mouse",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/984.1900x1900.jpg",
                    Description = "",
                    Price = decimal.Parse("55"),
                    Stuff = "БОРОШНО ПШЕНИЧНЕ В/Г\r\nмед\r\nцукор білий\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nБІЛОК ЯЄЧНИЙ\r\nцукрова пудра\r\nЖОВТОК ЯЄЧНИЙ\r\nкориця мелена\r\nцукор ванільний\r\nімбир мелений\r\nрозпушувач\r\nсік лимона\r\nмускатний горіх\r\nгвоздика мелена\r\nкоріандр",
                    Calories = "Калорійність ккал: 364.58\r\nКалорійність кДж: 1526.42\r\nЖири: 9.37\r\nНасичені жири: 5.9\r\nВуглеводи: 64.36\r\nЦукор: 32.52\r\nБілки: 5.72\r\nСіль: 0.04",
                    Weight = 0.04,
                    ShelfLife = 45,
                    StorageConditions = "при температурі не вище +25˚С і вологості не більше 65%",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Печиво"]
                };

                Product product4 = new Product
                {
                    Id = 4,
                    Title = "Іриска банан",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/809.1900x1900.jpg",
                    Description = "Вершкова іриска з в'яленим бананом",
                    Price = decimal.Parse("25"),
                    Stuff = "МАСЛО СОЛОДКОВЕРШКОВЕ 82,5%\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 30%\r\nцукор білий\r\nглюкоза\r\nбанан вялений\r\nцукор ванільний\r\nсіль",
                    Calories = "Калорійність ккал: 453.8\r\nКалорійність кДж: 1899.98\r\nЖири: 31.56\r\nНасичені жири: 28.78\r\nВуглеводи: 41.21\r\nЦукор: 35.35\r\nБілки: 1.23\r\nСіль: 0.44",
                    Weight = 0.02,
                    ShelfLife = 30,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Цукерки"]
                };

                Product product5 = new Product
                {
                    Id = 5,
                    Title = "Пряник контурний герої Star Wars",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/983.1900x1900.jpg",
                    Description = "",
                    Price = decimal.Parse("55"),
                    Stuff = "БОРОШНО ПШЕНИЧНЕ В/Г\r\nмед\r\nцукор білий\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nБІЛОК ЯЄЧНИЙ\r\nцукрова пудра\r\nЖОВТОК ЯЄЧНИЙ\r\nкориця мелена\r\nцукор ванільний\r\nімбир мелений\r\nрозпушувач\r\nсік лимона\r\nмускатний горіх\r\nгвоздика мелена\r\nкоріандр",
                    Calories = "Калорійність ккал: 364.58\r\nКалорійність кДж: 1526.42\r\nЖири: 9.36\r\nНасичені жири: 5.91\r\nВуглеводи: 64.37\r\nЦукор: 32.52\r\nБілки: 5.72\r\nСіль: 0.04",
                    Weight = 0.04,
                    ShelfLife = 45,
                    StorageConditions = "при температурі не вище+25˚С і вологості не більше 65%",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Печиво"]
                };

                Product product6 = new Product
                {
                    Id = 6,
                    Title = "Пряник контурний Породи собак",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/985.1900x1900.jpg",
                    Description = "",
                    Price = decimal.Parse("80"),
                    Stuff = "БОРОШНО ПШЕНИЧНЕ В/Г\r\nмед\r\nцукор білий\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nБІЛОК ЯЄЧНИЙ\r\nцукрова пудра\r\nЖОВТОК ЯЄЧНИЙ\r\nкориця мелена\r\nцукор ванільний\r\nімбир мелений\r\nрозпушувач\r\nсік лимона\r\nмускатний горіх\r\nгвоздика мелена\r\nкоріандр",
                    Calories = "Калорійність ккал: 362.09\r\nКалорійність кДж: 1515.98\r\nЖири: 9.51\r\nНасичені жири: 5.99\r\nВуглеводи: 63.36\r\nЦукор: 31.03\r\nБілки: 5.77\r\nСіль: 0.04",
                    Weight = 0.04,
                    ShelfLife = 45,
                    StorageConditions = "при температурі не вище+25˚С і вологості не більше 65%",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Печиво"]
                };

                Product product7 = new Product
                {
                    Id = 7,
                    Title = "Кримський горілий чізкейк",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/725.1900x1900.jpg",
                    Description = "Порційний чізкейк з кремовою серединкою, підгорілий зверху як самі знаєте який міст",
                    Price = decimal.Parse("170"),
                    Stuff = "СИР ВЕРШКОВИЙ 65% КРЕМЕТТЕ сир кисломолочний,згущувач: модифіко ваний крохмаль, стабілізатори: камідь рожкового дерева, гуарова камідь\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 30%\r\nцукор білий\r\nБІЛОК ЯЄЧНИЙ\r\nЖОВТОК ЯЄЧНИЙ\r\nМОЛОКО КОРОВ’ЯЧЕ 3,2%\r\nкрохмаль кукурудзяний\r\nсік лимона\r\nсіль",
                    Calories = "Калорійність ккал: 276.32\r\nКалорійність кДж: 1156.92\r\nЖири: 21.75\r\nНасичені жири: 12.44\r\nВуглеводи: 14.87\r\nЦукор: 12.23\r\nБілки: 5.28\r\nСіль: 0.46",
                    Weight = 0.23,
                    ShelfLife = 4,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Торти"]
                };

                Product product8 = new Product
                {
                    Id = 8,
                    Title = "Іриска лаванда",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/751.1900x1900.jpg",
                    Description = "Іриска на основі лавандових вершків, що не липне до зубів",
                    Price = decimal.Parse("25"),
                    Stuff = "МАСЛО СОЛОДКОВЕРШКОВЕ 82,5%\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 30%\r\nцукор білий\r\nглюкоза\r\nцукор ванільний\r\nлаванда сушена\r\nсіль",
                    Calories = "Калорійність ккал: 458.28\r\nКалорійність кДж: 1918.72\r\nЖири: 33.75\r\nНасичені жири: 30.86\r\nВуглеводи: 37.58\r\nЦукор: 33.45\r\nБілки: 1.05\r\nСіль: 0.44",
                    Weight = 0.02,
                    ShelfLife = 30,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Цукерки"]
                };

                Product product9 = new Product
                {
                    Id = 9,
                    Title = "Вафельна кокос-малина",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/907.1900x1900.jpg",
                    Description = "Хрустка цукерка із вафлею із додаванням кокосу та сублімованої малини, покрита білим шоколадом",
                    Price = decimal.Parse("25"),
                    Stuff = "ШОКОЛАД БІЛИЙ цукор, какао-масло, МОЛОКО сухе незбиране, МОЛОКО сухе знежирене, еквівалент какао-масла (негідрогенізовані пальмова олія, олія ши, олія ілліпе), жир МОЛОЧНИЙ,емульгатори(СОЄВИЙ лецитин Е476),ароматизатор\r\nБІСКВІТНІ ПЛАСТІВЦІ КРАКЕТИН (пшенична мука, молочний жир, негідрогенізована рослинна олія (кокосова), сіль, лактоза, ячмінний солодовий екстракт, цільне сухе молоко, емульгатор рапсовий лецитин, розрихлювач: бікарбонат натрію).\r\nкокосова стружка\r\nмалина сублімована\r\nмалина сублімована зерно",
                    Calories = "Калорійність ккал: 914.8\r\nКалорійність кДж: 3830.09\r\nЖири: 52.58\r\nНасичені жири: 32.52\r\nВуглеводи: 97.64\r\nЦукор: 86.7\r\nБілки: 12.76\r\nСіль: 0.62",
                    Weight = 0.02,
                    ShelfLife = 30,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Цукерки"]
                };

                Product product10 = new Product
                {
                    Id = 10,
                    Title = "Еклер лимонно-шоколадний",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/678.1900x1900.jpg",
                    Description = "Всередині лимонний вершково-заварний крем, шоколадна глазур та хрусткі рисові кульки в молочному шоколаді",
                    Price = decimal.Parse("99"),
                    Stuff = "ВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 35%\r\nБІЛОК ЯЄЧНИЙ\r\nБОРОШНО ПШЕНИЧНЕ В/Г\r\nцукор білий\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nЖОВТОК ЯЄЧНИЙ\r\nвода підготовлена\r\nМОЛОКО КОРОВ’ЯЧЕ 3,2%\r\nШОКОЛАД ТЕМНИЙ 54% (какао терте, цукор, какао масло, СОЄВИЙ ЛЕЦЕТИН(Е322), натуральний ароматизатор ванілі)\r\nсік лимона\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 10%\r\nолія рослинна соняшникова\r\nШОКОЛАДНІ КУЛЬКИ МОЛОЧНІ\r\nцукрова пудра\r\nцедра лимона\r\nсіль\r\nлимонна кислота моногідрат (Е330)",
                    Calories = "Калорійність ккал: 348.24\r\nКалорійність кДж: 1458.03\r\nЖири: 23.21\r\nНасичені жири: 14.03\r\nВуглеводи: 30.12\r\nЦукор: 20.4\r\nБілки: 4.72\r\nСіль: 0.26",
                    Weight = 0.07,
                    ShelfLife = 3,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Десерти"]
                };

                Product product11 = new Product
                {
                    Id = 11,
                    Title = "Еклер полуничний",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/677.1900x1900.jpg",
                    Description = "Еклер з вершково-заварним кремом, приклашений зверху полуничною глазур'ю та дрібними полуничними пластівцями",
                    Price = decimal.Parse("99"),
                    Stuff = "полуниця заморожена\r\nБІЛОК ЯЄЧНИЙ\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 35%\r\nцукор білий\r\nБОРОШНО ПШЕНИЧНЕ В/Г\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nЖОВТОК ЯЄЧНИЙ\r\nвода підготовлена\r\nМОЛОКО КОРОВ’ЯЧЕ 3,2%\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 30%\r\nолія рослинна соняшникова\r\nкрохмаль кукурудзяний\r\nкранч полуничний\r\nцукрова пудра\r\nжелатин\r\nсіль\r\nсік лимона\r\nлимонна кислота моногідрат (Е330)\r\nсік буряка концентрований",
                    Calories = "Калорійність ккал: 322.94\r\nКалорійність кДж: 1350.94\r\nЖири: 17.89\r\nНасичені жири: 10.69\r\nВуглеводи: 36.46\r\nЦукор: 24.49\r\nБілки: 4.17\r\nСіль: 0.22",
                    Weight = 0.08,
                    ShelfLife = 3,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Десерти"]
                };

                Product product12 = new Product
                {
                    Id = 12,
                    Title = "Кільце мигдалеве",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/684.1900x1900.jpg",
                    Description = "Заварне тістечко з масляно-заварним мигдалевим кремом всередині, прикрашене мигдалевими пластівцями та цукровою пудрою",
                    Price = decimal.Parse("99"),
                    Stuff = "МОЛОКО КОРОВ’ЯЧЕ 3,2%\r\nБОРОШНО ПШЕНИЧНЕ В/Г\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nЖОВТОК ЯЄЧНИЙ\r\nцукрова пудра\r\nБІЛОК ЯЄЧНИЙ\r\nМИГДАЛЬ СИРИЙ\r\nвода підготовлена\r\nМИГДАЛЬНІ ПЛАСТІВЦІ\r\nолія рослинна соняшникова\r\nлікер амаретто Madruzzo Amaretto\r\nкрохмаль кукурудзяний\r\nцукрова пудра нетануча\r\nцукор білий\r\nсіль",
                    Calories = "Калорійність ккал: 337.82\r\nКалорійність кДж: 1414.37\r\nЖири: 21.39\r\nНасичені жири: 7.5\r\nВуглеводи: 29.36\r\nЦукор: 16.96\r\nБілки: 6.98\r\nСіль: 0.26",
                    Weight = 0.11,
                    ShelfLife = 3,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Десерти"]
                };

                Product product13 = new Product
                {
                    Id = 13,
                    Title = "Гарбуз-карамель міні",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/832.1900x1900.jpg",
                    Description = "Шоколадна пісочна основа у поєднанні із гарбузовим ганашем та карамеллю під м'якою шапочкою меренги з кислинкою",
                    Price = decimal.Parse("89"),
                    Stuff = "гарбуз\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nцукор білий\r\nБОРОШНО ПШЕНИЧНЕ В/Г\r\nБІЛОК ЯЄЧНИЙ\r\nШОКОЛАД БІЛИЙ цукор, какао-масло, МОЛОКО сухе незбиране, МОЛОКО сухе знежирене, еквівалент какао-масла (негідрогенізовані пальмова олія, олія ши, олія ілліпе), жир МОЛОЧНИЙ,емульгатори(СОЄВИЙ лецитин Е476),ароматизатор\r\nцукрова пудра\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 30%\r\nЖОВТОК ЯЄЧНИЙ\r\nвода підготовлена\r\nглюкоза\r\nкакао\r\nкрохмаль кукурудзяний\r\nцедра апельсина\r\nсік лимона\r\nлимонна кислота моногідрат (Е330)\r\nсіль",
                    Calories = "Калорійність ккал: 365.95\r\nКалорійність кДж: 1532.16\r\nЖири: 20.16\r\nНасичені жири: 13.23\r\nВуглеводи: 41.66\r\nЦукор: 29.38\r\nБілки: 4.47\r\nСіль: 0.19",
                    Weight = 0.06,
                    ShelfLife = 3,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Десерти"]
                };

                Product product14 = new Product
                {
                    Id = 14,
                    Title = "Горіх-карамель міні",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/871.1900x1900.jpg",
                    Description = "Основа з пісочного тіста, наповнена карамеллю і міксом з фундука, мигдалю та прикрашена подрібненною фісташкою",
                    Price = decimal.Parse("89"),
                    Stuff = "МАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nБОРОШНО ПШЕНИЧНЕ В/Г\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 30%\r\nцукор білий\r\nМИГДАЛЬ СИРИЙ\r\nФУНДУК\r\nглюкоза\r\nцукрова пудра\r\nЖОВТОК ЯЄЧНИЙ\r\nФІСТАШКА ЧИЩЕНА\r\nсіль",
                    Calories = "Калорійність ккал: 486.71\r\nКалорійність кДж: 2037.74\r\nЖири: 35.57\r\nНасичені жири: 17.39\r\nВуглеводи: 35.43\r\nЦукор: 18.21\r\nБілки: 6.22\r\nСіль: 0.35",
                    Weight = 0.05,
                    ShelfLife = 4,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Десерти"]
                };

                Product product15 = new Product
                {
                    Id = 15,
                    Title = "Лимонна міні",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/898.1900x1900.jpg",
                    Description = "Пісочна основа, лимонний мармелад та крем на основі вершків з додаванням бобів тонка",
                    Price = decimal.Parse("89"),
                    Stuff = "ВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 30%\r\nШОКОЛАД БІЛИЙ цукор, какао-масло, МОЛОКО сухе незбиране, МОЛОКО сухе знежирене, еквівалент какао-масла (негідрогенізовані пальмова олія, олія ши, олія ілліпе), жир МОЛОЧНИЙ,емульгатори(СОЄВИЙ лецитин Е476),ароматизатор\r\nБОРОШНО ПШЕНИЧНЕ В/Г\r\nсік лимона\r\nцукор білий\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nМОЛОКО КОРОВ’ЯЧЕ 3,2%\r\nцедра лимона\r\nцукрова пудра\r\nвода підготовлена\r\nглюкоза\r\nЖОВТОК ЯЄЧНИЙ\r\nкрохмаль кукурудзяний\r\nжелатин\r\nагар-агар\r\nбоби Тонка",
                    Calories = "Калорійність ккал: 309.13\r\nКалорійність кДж: 1294.26\r\nЖири: 17.13\r\nНасичені жири: 11.18\r\nВуглеводи: 34.83\r\nЦукор: 23.96\r\nБілки: 3.92\r\nСіль: 0.07",
                    Weight = 0.08,
                    ShelfLife = 3,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Десерти"]
                };

                Product product16 = new Product
                {
                    Id = 16,
                    Title = "Матча міні",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/800.1900x1900.jpg",
                    Description = "Пісочна основа, грильяж з білого та чорного кунжуту і ганаш з Аораші матча",
                    Price = decimal.Parse("100"),
                    Stuff = "ШОКОЛАД БІЛИЙ цукор, какао-масло, МОЛОКО сухе незбиране, МОЛОКО сухе знежирене, еквівалент какао-масла (негідрогенізовані пальмова олія, олія ши, олія ілліпе), жир МОЛОЧНИЙ,емульгатори(СОЄВИЙ лецитин Е476),ароматизатор\r\nБОРОШНО ПШЕНИЧНЕ В/Г\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 30%\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nцукор білий\r\nцукрова пудра\r\nвода підготовлена\r\nЖОВТОК ЯЄЧНИЙ\r\nКУНЖУТ БІЛИЙ\r\nКУНЖУТ ЧОРНИЙ\r\nсік лимона\r\nглюкоза\r\nчай матча\r\nчай матча",
                    Calories = "Калорійність ккал: 412.97\r\nКалорійність кДж: 1729.01\r\nЖири: 25.25\r\nНасичені жири: 15.3\r\nВуглеводи: 41.02\r\nЦукор: 26.49\r\nБілки: 5.42\r\nСіль: 0.09",
                    Weight = 0.05,
                    ShelfLife = 4,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Десерти"]
                };

                Product product17 = new Product
                {
                    Id = 17,
                    Title = "Мохіто міні",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/868.1900x1900.jpg",
                    Description = "Пісочна основа, ганаш із свіжою м'ятою та лаймом, прикрашена свіжою лохиною",
                    Price = decimal.Parse("89"),
                    Stuff = "лохина свіжа\r\nШОКОЛАД БІЛИЙ цукор, какао-масло, МОЛОКО сухе незбиране, МОЛОКО сухе знежирене, еквівалент какао-масла (негідрогенізовані пальмова олія, олія ши, олія ілліпе), жир МОЛОЧНИЙ,емульгатори(СОЄВИЙ лецитин Е476),ароматизатор\r\nБОРОШНО ПШЕНИЧНЕ В/Г\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 30%\r\nцукрова пудра\r\nЖОВТОК ЯЄЧНИЙ\r\nсік лимона\r\nсік лайма\r\nмята\r\nцедра лайма",
                    Calories = "Калорійність ккал: 330.42\r\nКалорійність кДж: 1383.38\r\nЖири: 19.88\r\nНасичені жири: 12.63\r\nВуглеводи: 33.34\r\nЦукор: 21.22\r\nБілки: 4.55\r\nСіль: 0.09",
                    Weight = 0.06,
                    ShelfLife = 3,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Десерти"]
                };

                Product product18 = new Product
                {
                    Id = 18,
                    Title = "Вівсяний кукіс-міні з журавлиною і горіхом",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/670.1900x1900.jpg",
                    Description = "Вівсяні пластівці в тісті з волоськими горіхами та в’яленною журавлиною - один з бестселлерів у всі часи",
                    Price = decimal.Parse("59"),
                    Stuff = "вівсяні пластівці\r\nжуравлина в'ялена\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nГОРІХ ВОЛОСЬКИЙ\r\nцукор білий\r\nБОРОШНО ПШЕНИЧНЕ В/Г\r\nцукор тростинний\r\nБІЛОК ЯЄЧНИЙ\r\nЖОВТОК ЯЄЧНИЙ\r\nрозпушувач",
                    Calories = "Калорійність ккал: 433.4\r\nКалорійність кДж: 1814.55\r\nЖири: 21.98\r\nНасичені жири: 9.5\r\nВуглеводи: 52.6\r\nЦукор: 18.5\r\nБілки: 6.3\r\nСіль: 0.04",
                    Weight = 0.02,
                    ShelfLife = 14,
                    StorageConditions = "при температурі +18+25˚С і вологості до 65%",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Цукерки"]
                };

                Product product19 = new Product
                {
                    Id = 19,
                    Title = "ДаблБрауні малина міні",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/686.1900x1900.jpg",
                    Description = "Подвійний брауні з шоколадним ганашем і малиновим мармеладом",
                    Price = decimal.Parse("750"),
                    Stuff = "цукор білий\r\nмалина заморожена\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 20%\r\nШОКОЛАД ЧОРНИЙ 70% (какао терте, цукор, какао масло, СОЄВИЙ ЛЕЦЕТИН(Е322), натуральний ароматизатор ванілі)\r\nШОКОЛАД ЧОРНИЙ 62% (какао терте, цукор, какао масло, СОЄВИЙ ЛЕЦЕТИН(Е322), натуральний ароматизатор ванілі)\r\nМАСЛО СОЛОДКОВЕРШКОВЕ 72,5%\r\nБІЛОК ЯЄЧНИЙ\r\nБОРОШНО ПШЕНИЧНЕ В/Г\r\nШОКОЛАД ТЕМНИЙ 54% (какао терте, цукор, какао масло, СОЄВИЙ ЛЕЦЕТИН(Е322), натуральний ароматизатор ванілі)\r\nЖОВТОК ЯЄЧНИЙ\r\nВЕРШКИ З КОРОВ’ЯЧОГО МОЛОКА 10%\r\nШОКОЛАДНА КРИХТА (какао терте, цукор, какао масло, СОЄВИЙ ЛЕЦЕТИН(Е322), натуральний ароматизатор ванілі)\r\nглюкоза\r\nкакао\r\nШОКОЛАДНІ КУЛЬКИ ЧОРНІ\r\nмалина сублімована\r\nКАВА В ШОКОЛАДІ\r\nвода підготовлена\r\nсік лимона\r\nрозпушувач\r\nпектин NH\r\nсіль\r\nлимонна кислота моногідрат (Е330)",
                    Calories = "Калорійність ккал: 398.38\r\nКалорійність кДж: 1667.94\r\nЖири: 25.61\r\nНасичені жири: 14.3\r\nВуглеводи: 36.5\r\nЦукор: 27.87\r\nБілки: 5.46\r\nСіль: 0.15",
                    Weight = 0.75,
                    ShelfLife = 3,
                    StorageConditions = "при температурі від +2 до +6˚С",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Торти"]
                };

                Product product20 = new Product
                {
                    Id = 20,
                    Title = "Шоколадно-мигдалева з фісташкою",
                    Photo = "https://bakerstreetbakery.com.ua/files/resized/products/916.1900x1900.jpg",
                    Description = "Мигдаль, фісташка, дрібка солі та білий шоколад",
                    Price = decimal.Parse("40"),
                    Stuff = "ШОКОЛАД БІЛИЙ цукор, какао-масло, МОЛОКО сухе незбиране, МОЛОКО сухе знежирене, еквівалент какао-масла (негідрогенізовані пальмова олія, олія ши, олія ілліпе), жир МОЛОЧНИЙ,емульгатори(СОЄВИЙ лецитин Е476),ароматизатор\r\nФІСТАШКА ЧИЩЕНА\r\nМИГДАЛЬ ПОДРІБЛЕНИЙ\r\nсіль",
                    Calories = "Калорійність ккал: 444.22\r\nКалорійність кДж: 1859.86\r\nЖири: 28.28\r\nНасичені жири: 10.74\r\nВуглеводи: 31.8\r\nЦукор: 25.42\r\nБілки: 15.63\r\nСіль: 0.76",
                    Weight = 0.02,
                    ShelfLife = 45,
                    StorageConditions = "при температурі від +4до +22˚С і вологості не вище 60%",
                    isFavourite = false,
                    Available = true,
                    Category = Categories["Цукерки"]
                };

                content.AddRange(product1, product2, product3, product4, product5, product6, product7, product8, product9, 
                    product10, product11, product12, product13, product14, product15, product16, product17, product18, product19, product20);

            }
            content.SaveChanges();
        }


            private static Dictionary<string, Category> category;
    public static Dictionary<string, Category> Categories
    {
        get
        {
            if (category == null)
            {
                Category cookie = new Category { Id = 1, Name = "Печиво", Description = "It is cookies!" };
                Category cake = new Category { Id = 2, Name = "Торти", Description = "It is cakes!" };
                Category candy = new Category { Id = 3, Name = "Цукерки", Description = "It is candies!" };
                Category dessert = new Category { Id = 4, Name = "Десерти", Description = "It is desserts!" };

                var list = new Category[] { cookie, cake, candy, dessert };
                category = new Dictionary<string, Category>();
                foreach (Category el in list)
                {
                    category.Add(el.Name, el);
                }
            }
            return category;
        }
    }
        }
    


}

